app/controllers/api/v1/class_periods_controller.rb

SELECT "class_periods".* FROM "class_periods"
---
  def index
    @class_period = ClassPeriod.all

INSERT INTO "class_periods" ("attendance_count", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["attendance_count", 5], ["created_at", "2019-08-25 03:29:32.661144"], ["updated_at", "2019-08-25 03:29:32.661144"]]
---
  def create
    @class_period = ClassPeriod.new(class_period_params)

    if @class_period.save