app/controllers/api/v1/schools_controller.rb

  def create
    @school = School.new(school_params)

    if @school.save
---
INSERT INTO "schools" ("name", "created_at", "updated_at", "channel_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test App School"], ["created_at", "2019-08-25 18:52:45.852674"], ["updated_at", "2019-08-25 18:52:45.852674"], ["channel_name", "test_costum_apps"]]