app/controllers/api/v1/slack_class_periods_controller.rb

SELECT "class_periods".* FROM "class_periods"
---
  def index
    @class_period = ClassPeriod.all

INSERT INTO "class_periods" ("attendance_count", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["attendance_count", 19], ["created_at", "2019-08-25 18:56:22.260103"], ["updated_at", "2019-08-25 18:56:22.260103"]]
---
  def create
    @class_period = ClassPeriod.new#(class_period_params)
    @class_period.attendance_count = params[:text]

    @school = School.where(:channel_name => params[:channel_name])
    #@school.class_periods << @class_period
    #@school.update(:class_periods => @class_period)

    if @class_period.save