app/views/schools/show.html.erb


  <% ClassPeriod.where(:channel_name => @school.channel_name).each do |class_period| %>
---
SELECT "class_periods".* FROM "class_periods" WHERE "class_periods"."channel_name" = $1  [["channel_name", "test_costum_apps"]]