app/controllers/class_periods_controller.rb

SELECT "class_periods".* FROM "class_periods"
---
  def index
    @class_periods = ClassPeriod.all

INSERT INTO "class_periods" ("week_day", "attendance_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["week_day", "Saturday"], ["attendance_count", 6], ["created_at", "2019-08-24 19:28:00.681397"], ["updated_at", "2019-08-24 19:28:00.681397"]]
---
  def create
    @class_period = ClassPeriod.new(class_period_params)

    respond_to do |format|
      if @class_period.save

DELETE FROM "class_periods" WHERE "class_periods"."id" = $1  [["id", 1]]
---
  def destroy
    @class_period.destroy

SELECT "class_periods".* FROM "class_periods" WHERE "class_periods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_class_period
      @class_period = ClassPeriod.find(params[:id])