app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "created_at", "updated_at", "channel_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Morton"], ["created_at", "2019-08-26 00:29:03.000553"], ["updated_at", "2019-08-26 00:29:03.000553"], ["channel_name", "morton"]]
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save

DELETE FROM "schools" WHERE "schools"."id" = $1  [["id", 8]]
---
  def destroy
    @school.destroy

SELECT "class_periods".* FROM "class_periods" WHERE "class_periods"."channel_name" = $1  [["channel_name", "test_costum_apps"]]
SELECT COUNT(*) FROM "class_periods" WHERE "class_periods"."channel_name" = $1  [["channel_name", "test_costum_apps"]]
---
  def set_avg_attendance
    total = 0
    class_periods = ClassPeriod.where(:channel_name => @school.channel_name)
    class_periods.each { |class_period|
        total += class_period.attendance_count
    }
    count = class_periods.count