app/controllers/staff_controller.rb

SELECT "staffs".* FROM "staffs"
---
  def index
    @staffs = Staff.all