app/controllers/staffs_controller.rb

  def index
    @staffs = Staff.all
---
SELECT "staffs".* FROM "staffs"

  def create
    @staff = Staff.new(staff_params)

    respond_to do |format|
      if @staff.save
---
INSERT INTO "staffs" ("first_name", "last_name", "total_hours", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Test"], ["last_name", "Staff"], ["total_hours", 3.0], ["created_at", "2019-08-25 21:18:58.943341"], ["updated_at", "2019-08-25 21:18:58.943341"]]

  def update
    respond_to do |format|
      if @staff.update(staff_params)
---
UPDATE "staffs" SET "field_trip_hours" = $1, "total_hours" = $2, "updated_at" = $3 WHERE "staffs"."id" = $4  [["field_trip_hours", 1.6], ["total_hours", 9.6], ["updated_at", "2019-08-26 00:10:59.830120"], ["id", 2]]

  def destroy
    @staff.destroy
---
DELETE FROM "staffs" WHERE "staffs"."id" = $1  [["id", 2]]

    def set_staff
      @staff = Staff.find(params[:id])
---
SELECT "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]