app/models/school.rb

    def calculate_avg_attendance
        total = 0
        class_periods = ClassPeriod.where(:channel_name => self.channel_name)
        class_periods.each { |class_period|
            total += class_period.attendance_count
        }
        count = class_periods.count
---
SELECT "class_periods".* FROM "class_periods" WHERE "class_periods"."channel_name" = $1  [["channel_name", ""]]
SELECT COUNT(*) FROM "class_periods" WHERE "class_periods"."channel_name" = $1  [["channel_name", ""]]